{"class_name": "Sequential", "keras_version": "2.1.2", "config": [{"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "use_bias": true, "batch_input_shape": [null, 2048], "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "units": 100, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "units": 50, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "units": 10, "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "units": 1, "trainable": true}}], "backend": "tensorflow"}